# SetColorChoice

## Description
Sets the choice for the color popup dialog control to the specified color index.

```pascal
PROCEDURE SetColorChoice(
				dialogID   : LONGINT;
				itemID     : LONGINT;
				colorIndex : INTEGER);
```

```python
def vs.SetColorChoice(dialogID, itemID, colorIndex):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|   |
|itemID|LONGINT|   |
|colorIndex|INTEGER|   |

## Examples
lorPopupDialog}}

## Version
Availability: from VectorWorks12.0

## Category
* Dialogs - Modern